# 游戏的脚本可置于此文件中。
style red_highlight:
    color "ff8081"
    size 45
transform shake:
    linear 0.05 xoffset -10
    linear 0.05 xoffset 10
    repeat
# 声明此游戏使用的角色。颜色参数可使角色姓名着色。

layeredimage bs:
    offset (0,-300)
    always:
        "images/in chr/bs1_in010101.jpg"

    group face:
        offset(33.5,91)
        attribute happy:
            "images/in chr/bs1_in_f01_02.jpg"
layeredimage ao:
    offset(90,150)
    group outfit:
        attribute stu_stand:
            offset(-226,-122)
            "images/ao chr/bs2_ao011101.jpg"
        attribute com_stand:
            offset(-222,-126)
            "images/ao chr/bs2_ao021101.jpg"
        attribute jap_stand:
            offset(-250,-121)
            "images/ao chr/bs2_ao031101.jpg"
    group face:
        attribute eye_closed_smile:
            "images/ao chr/bs2_ao_f11_08.jpg"
        attribute com:
            "images/ao chr/bs2_ao_f11_12.jpg"
        attribute eye_closed:
            "images/ao chr/bs2_ao_f11_15.jpg"
        attribute eye_closed_feeling:
            "images/ao chr/bs2_ao_f11_11.jpg"
        attribute what_can_i_say:
            "images/ao chr/bs2_ao_f11_18.jpg"
        attribute eye_closed_feel_bad:
            "images/ao chr/bs2_ao_f11_15.jpg"
        attribute smile:
            "images/ao chr/bs2_ao_f11_19.jpg"
        attribute earnest:
            "images/ao chr/bs2_ao_f11_05.jpg"
layeredimage ai:
    zoom 0.3
    yalign 0.3
    always:
        "images/ai chr/ai.png"
layeredimage ru:
    offset(0,300)
    group outfit:
        attribute normal:
            "images/ru chr/bs2_ru040101.jpg"
    group face:
        attribute smile:
            offset(217.34,141.637)
            "images/ru chr/bs2_ru_f01_02.jpg"
layeredimage ky:
    offset(0,300)
    group outfit:
        attribute normal:
            "images/ky chr/bs2_ky010101.jpg"
    group face:
        attribute want_to_say:
            offset(154,74)
            "images/ky chr/bs2_ky_f01_11.jpg"
        attribute smile:
            offset(154,74)
            "images/ky chr/bs2_ky_f02_02.jpg"
        attribute surprise:
            offset(154,74)
            "images/ky chr/bs2_ky_f01_09.jpg"
        

# 游戏在此开始。

label start:
    $ ending=0
    play music "bgm/bgm01.ogg"
    scene bg001a1 with fade
    "鸟白岛上，有一种独特的祭祀，山之祭祀。"
    scene bg011n with fade 
    "祭祀的主持者需要手持灯笼，在山中漫步。"
    "当然，那些东西只是一种习惯罢了，是古代科学尚未发展时人们的幻想。"
    "毕竟在这个科学主导的世界上，怎么可能存在什么超自然现象呢？"
    "……开玩笑的。"
    "这个夏天，我和一个名叫苍的少女相识，相爱，共同度过了一段无可替代的时光。"
    "我也明白了，风俗什么的，只是一个用以转移注意力的借口罢了。"
    "山之祭祀绝不仅仅是那种老祖宗留下来的传说而已。"
    "那些发光的神秘蝴蝶，叫七影蝶，是这个小岛上人们魂魄的化身，拥有能够通过接触传递记忆的强大力量。"
    "而山之祭祀，则是将迷失的愿望引导回它们所应该回到的地方去。"
    stop music fadeout 2.0
    show bs happy with dissolve
    "稻荷" "嘣！"
    "蓝色小狐狸的叫声将我拉回了现实。"
    "这个名叫稻荷的生物，似乎能够听懂人们的对话。"
    show bs happy with ease:
        xoffset -300
    show ao com_stand eye_closed with dissolve:
        xalign 0.8
    "我背上的这个叫苍的少女，正安心地睡着。"
    "然而，我却不仅要忍受背上的重量，还要和困意做斗争。"
    "由于刚刚摸过苍的七影蝶，大脑需要休息来整理刚刚传来的信息。"
    scene bg_kuro with fade
    "双脚似乎自动往前走着。"
    "脑中浮现出一幕幕……"
    scene bg001a1 with fade
    play music "bgm/bgm04.ogg" fadein 1.2
    "是这个夏天发生的事情。"
    "我为了整理祖母的遗物，来到了这座叫做鸟白岛的岛上，和苍在树下相遇了。"
    scene bg019n1 with fade
    "在某次睡觉前，山上的一点亮光吸引了我的注意力。"
    scene bg011n with fade
    show ao jap_stand eye_closed with dissolve
    "怀着好奇心来到山上，发现穿着巫女服的苍正在触碰发光蝴蝶。"
    scene cg_ao03_0203 with fade
    "通过仓库里的古书，我明白了这些蝴蝶叫七影碟，是人死后魂魄化身的蝴蝶，向活着的人传递着思念之情。"
    "由于想要见苍，意外之下，我自己也在夜晚的山中触摸了这种蝴蝶。"
    scene bg011n1 with fade
    "……却被其中传来的记忆所控制，在不自知的情况下缓缓移动到了悬崖边。"
    "危急时刻，苍把我从悬崖边救了下来。"
    show ao jap_stand earnest with dissolve
    "而苍也没有隐瞒，告诉了我山之祭祀和七影蝶的真相。"
    "这个小岛，是记忆回归的地方。"
    "具有强烈迷恋和后悔的人类的记忆，回到了岛上。"
    "山之祭，就是将不能留在世上的七影碟引导回应该归去的地方的一种祭祀。"
    "而之所以她打破禁忌，不断触摸蝴蝶，是为了找到一个重要的记忆。"
    scene cg_ao04_0101 with fade
    "那是她的姐姐，蓝的记忆。"
    "为了拯救摔下悬崖而沉睡的姐姐，她必须检查所有七影蝶的记忆，试图找回蓝的记忆，并送回蓝的体内。"
    "而我祖母的遗物中，就有一本书，记载着将七影蝶中蕴含的记忆送回体内的方法。"
    scene cg_ao09_0102 with fade
    "在我的陪伴和苍的努力下，蓝找回了记忆，但触摸太多七影蝶的苍却随之陷入沉睡……"
    scene cg_ao11_0101 with fade
    "最后，包含着记忆的七影蝶从她体内涌出，而她自己的那只七影蝶也飞向天空，近在咫尺，却又遥不可及。"
    "因此，我下定决心，要找回苍的记忆，正如苍找回蓝的记忆一样。"
    stop music fadeout 2.0
    scene bg_kuro with fade
    "……一阵疼痛传来。"
    scene bg011n
    "稻荷" "嘣！！！嘣！！！"
    "狐狸牙齿带来的疼痛和焦急的叫声，让我的意识回到了现实。"
    "原来，不知不觉地，我已经睡着了啊。"
    "羽依里" "谢谢你，稻荷。"
    "下山的路，只剩一点点了。"
    "再坚持一下吧。"
    "……"
    scene bg_kuro with fade
    "我缓缓拉开了病房的房门。"
    scene cg_ao09_0201 with fade
    "背上的苍仍然在熟睡着。我把她放到床上，盖好被子。"
    "羽依里" "……"
    "蓝" "……"
    "一阵沉默。"
    play music "bgm/bgm20.ogg" fadein 2.0
    "不知为何，我又把苍带到了迷途橘上。"
    "或许是内心还抱着一些希望吧。"
    "一旁熟睡的苍正发出着均匀的呼吸声。"
    "苍" "唔唔，羽依里，不要走……想……在一起……嗯嗯……"
    "羽依里" "知道了啦……"
    "羽依里" "果然，只能用那个方法了。"
    "蓝" "该不会是那个方法吧。"
    "羽依里" "没错，就是那个。"
    "我要追随苍的脚步，去完成属于我的使命。"
    "蓝" "……明年？"
    "羽依里" "无论多少年，我也要找到。苍找到你的七影蝶花了10年……即使需要花20年，甚至一辈子，我会永远找下去。"
    "唤醒苍，可是我的职责啊。"
    "在苍的七影蝶飞走之后，我已经下定了决心。"
    "蓝" "虽然我也想看到苍露出笑容的样子，但这可是10年啊……为了一个不是自己亲人的人，值得吗？"
    "羽依里" "苍是我最重要的人。况且，苍已经算是我的亲人了。"
    "蓝" "那我也去。不管10年，还是20年……"
    "面前的蓝脸上充满了坚定。"
    "是想要报答苍吗？还是空门家的职责所在？又或者……是想要陪在我的身边？"
    "……对于一个妹控，和夺走自己妹妹的人整天呆在一起这种可能性根本不存在吧。"
    "羽依里" "你不是看不见七影蝶吗？"
    "蓝" "不，我想陪你找……直到苍醒来的那一天。"
    "陪着我？"
    "蓝" "空门家的职责，还记得吗？既然苍不在，那么我来替代她吧。"
    stop music fadeout 0.5
    play music "bgm/bgm12.ogg" fadein 2.0
    "蓝" "不过，有一件事情，我想问一下。"
    "羽依里" "什么事情？"
    "蓝" "你和苍，那个……是不是已经做过那种事情了？"
    "蓝" "她最近的梦话，越来越……怎么说呢？"
    "蓝的脸已经通红了。"
    "羽依里" "等等……那个真的只是……梦话……而已。"
    "看来，可能要瞒不住了。那天晚上，在亲吻之后，在山上的树林里……"
    "苍" "羽依里……请……温柔一点……嗯嗯……"
    "这个梦话可真是不妙啊。现在轮到我解释，不，“掩饰”了吗？"
    menu:
        "转移话题":
            jump ch0_1_c1
        "老实承认":
            jump ch0_1_c2
label ch0_1_c1:
    "暂且找个其他话题吧？"
    "羽依里" "话说，如果我和苍结婚的话，就要叫空门羽依里了吧？还是叫鹰原苍好呢？果然还是把空门的姓氏传递下去好……"
    "蓝" "……果然做过了呢。都想着结婚以后的事情了。"
    "这根本不能叫转移话题吧！？"
    "羽依里！该好好锻炼一下转移话题的技术了！"
    stop music fadeout 1.0
    jump ch0_2
label ch0_1_c2:
    play music "bgm/bgm36.ogg" fadein 2.0
    "羽依里" "嗯……好吧，虽然有点说不出口，不过确……确实……做过了。"
    "说这话时整个人都在颤抖。"
    "蓝" "你还挺诚实啊。是不是想很快生出小宝宝啊？"
    "羽依里" "……"
    "现在已经不止是我和苍间的秘密了。"
    stop music fadeout 1.0
    jump ch0_2
label ch0_2:
    
    "蓝露出了可怕的脸色。"
    "羽依里" "那个，不是，嗯，啊……对不起！今天已经很晚了我明天再来吧啊啊啊"
    scene bg009n with fade
    play music "bgm/bgm11.ogg" fadein 1.0
    "我一溜烟跑出了蓝和苍的病房。"
    "鸟白岛熟悉的乡间小路。"
    "是什么时候变得如此熟悉的呢？"
    "回望这个夏天，和苍一起度过的时光。"
    "树下沉睡的少女，粗点心店的打工，海边的相遇……"
    "不知是不是触碰苍的七影蝶的效果，我的记忆格外清晰。"
    "羽依里" "苍，这个夏天我过得，真的很开心。"
    "今天就是8月28日了啊。"
    "后天早上，我就必须离开鸟白岛了。"
    "在接近假期尾声的这个深夜里，要做点什么呢？"
    menu:
        "什么都不做":
            jump ch0_2_c1
        "去迷途橘看看":
            jump ch0_2_c2
label ch0_2_c1:
    "还是睡觉吧。"
    scene bg019n1 with fade
    "回到家里的时候，海己和镜子阿姨看起来都已经睡了。"
    scene bg019n3 with dissolve
    "那么我也去睡觉吧。"
    $ ending=1
    jump ch0_3

label ch0_2_c2:
    scene bg011n with fade
    "夜晚的山路还是那么熟悉。"
    "在稻荷的带领下，一路上没有遇到七影蝶。"
    scene bg202n1 with fade
    "迷途橘上盘旋的七影蝶早已不见，花自然也是凋谢的。"
    "挂在树边的灯笼，静静地等待着山之祭祀的到来。"
    "树下的人却只有一个。"
    "脑海中浮现出苍的笑容。"
    "我拿出包里的蝴蝶标本和古书的译本，埋在了树下。"
    "羽依里" "苍，等你醒来，我们再一起把它们挖出来，一起读完剩下的一半……"
    "羽依里" "到时候，我还要请教你里面的故事真不真实呢……"
    "羽依里" "苍……我们不是还有一个约定吗……"
    "泪水不知不觉滑下了脸颊。"
    "我仰望着天空，祈求奇迹的出现。"
    "那种事情当然不可能在现实中存在。"
    "……真的没办法吗？"
    show bs with dissolve
    "稻荷的叫声突然传来。"
    "我心里一紧，望向它所在的方向，盼望着能看到那只七影蝶。"
    "……它对着天空中的月亮叫起来。原来是提醒我快后半夜了啊。"
    "还是放弃那些不切实际的幻想吧。"
    "这个世界上的任何事情，都是脚踏实地地做事带来的结果。"
    "赶紧回去睡觉吧。明天还要继续陪苍呢。"
    jump ch0_3
label ch0_3:
    scene bg019n3 with fade
    "躺在床上，脑中的回忆不断显现。"
    "羽依里" "根本睡不着啊。"
    "不过，注意力很快就被分散了。"
    "讨厌的蚊子突然出现，在我耳边嗡嗡叫着。"
    "羽依里" "可恶……还是打不到。"
    "我放弃了挣扎。"
    "不知是太累的缘故，还是蚊子分散了注意力，这次我很快入睡了。"
    stop music fadeout 2.0
    scene bg002a with fade
    "这是在哪里呢……？"
    "面前的商店如此熟悉。"
    "是粗点心店啊。"
    show ao com_stand smile with dissolve
    "苍" "欢迎光临……是你啊。"
    "羽依里" "苍？你不是……？"
    "苍" "别管那么多了，跟我来吧。"
    "羽依里" "嗯？去哪里？"
    "苍自顾自地走了出去。"
    "我只好跟上。"
    scene bg010a with fade
    "她带我来到了那棵她经常睡觉的树下。"
    show ao com_stand smile with dissolve
    "苍" "准备好了吗？"
    "羽依里" "什么准备好了？"
    "苍" "当然是……"
    play music "bgm/bgm34.ogg" fadein 1.5
    show ao com_stand eye_closed_smile:
        xalign 0.49
        linear 0.1 xalign 0.51
        linear 0.1 xalign 0.49
        repeat
    "苍把我一把推倒。"
    "羽依里" "！？"
    "苍" "上次在我睡觉的时候挠痒是吧？我今天也要让你来体验一下……"
    "羽依里" "哈哈哈……快停下……"
    "没想到苍的力气如此大，我根本无法动弹。"
    stop music fadeout 3.0
    "不过，能够见到珍视的人，本身就已经很令人高兴了。"
    play music "bgm/bgm21.ogg" fadein 2.0
    "我不再挣扎，感受着面前少女手心传来的温度。"
    "……"
    scene bg019a1 with fade
    "梦醒了。"
    "醒来的时候，嘴上似乎带着一抹微笑。"
    "羽依里" "原来是梦。为什么那种感觉那么真实啊。"
    "羽依里" "能见到珍视的人，真是太好了……"
    "……突然发现身上被蚊子咬了。"
    "从来没有在这里被咬过啊。海己牌人体蚊虫诱捕器失效了吗？"
    "我起身之后，才发现桌上放着一张小纸条。"
    "我要走了哦～再见，羽依里同学。"
    "是海己的留言。似乎昨天就在这里了。"
    "背面还有一行小字。"
    "早饭在冰箱里了哟。"
    scene bg017a with fade
    "重新加热的炒饭果然没有平时好吃啊。突然发现自己竟然已经习惯了有海己的生活。"
    stop music fadeout 3.0
    "好了，今天要做什么呢？"
    "先去诊所吧，苍还等着我呢。"
    scene cg_ao04_0103 with fade
    "羽依里" "早上好。"
    play music "bgm/bgm12.ogg" fadein 1.0
    scene cg_ao04_0205 with dissolve
    "蓝" "早上好啊，今天要和苍结婚吗？"
    "蓝手中拿着苍的身体检查报告，其中“年龄”一栏上画了一个大大的红圈。显然这个数值是小于18的。"
    "羽依里" "这话和这个圈是怎么回事啊！"
    "看来蓝的气还没消。"
    "羽依里" "我也没说要这么快结婚吧！？"
    scene cg_ao04_0204 with dissolve
    "蓝" "虽然我已经把苍许诺给你了，不过你可别想在她睡着的时候做什么坏事哦？"
    "这家伙对苍还真的有一种很强的占有欲。"
    "羽依里" "……"
    scene cg_ao09_0102 with fade
    "还是和苍说说话吧。"
    "羽依里" "苍，灯笼我已经挂好了哦。"
    "羽依里" "昨天我做了一个梦……"
    "等等，这个还是不要说好了。"
    "毕竟蓝还在旁边。"
    "羽依里" "我梦见你醒过来了……"
    "我省去了挠痒痒的部分。"
    "这样就好了。虽然不完整，但毕竟不是错误的记忆。"
    "羽依里" "话说，我好像暑假作业还没写完。"
    "蓝" "你这话题转换得是否有点太快了？"
    "羽依里" "是因为想到了苍昨天晚上的事情嘛。"
    "蓝" "昨晚发生了什么？"
    "我把昨天晚上苍在迷途橘下释放出七影蝶，并且被蝴蝶包裹告诉了蓝。"
    "蓝" "你的意思是，苍通过七影蝶获得的知识，已经不复存在了？"
    "羽依里" "没错。"
    "蓝" "苍之前说过，是靠自己触碰七影蝶才知道了很多知识……"
    "蓝" "她在学校里经常睡觉啊。"
    "羽依里" "也就是说，苍她现在的认知水平已经倒退了好几年？"
    "蓝" "大概是这样吧。"
    "我突然感觉责任重大。"
    "如果苍醒来的时候无法跟上同龄人，那么她这几年不就白过了吗？即使醒来，我们还能正常沟通吗？"
    "为了蓝，她付出了10年，现在即使醒过来也要落得这样的结局……"
    "不，我绝对不允许那种事情发生。"
    "我立即从包里掏出……暑假作业？"
    "……开始读上面的内容。"
    "蓝" "你这是在干什么呢？希望苍梦游帮你写作业？"
    "羽依里" "你在说什么啊。当然是为了提升苍的认知能力啊。"
    "蓝" "暑假作业也太不靠谱了点吧！好歹拿个课本啊！"
    "羽依里" "没办法嘛～毕竟书全在家里。"
    "羽依里" "我下次带过来吧。我不在的时候，就拜托蓝了。"
    "蓝" "嗯。除此之外，我就把苍跟我说过的事情再复述一遍吧。"
    "羽依里" "嗯，拜托你了。"
    stop music fadeout 2.0
    scene bg009e with fade
    "离开医院之后已经是下午了。"
    play music "bgm/bgm01b.ogg" fadein 2.0
    "心里突然有点舍不得。"
    "这个暑假就要结束了啊。"
    "明明认识了那么多人，经历了那么多事情，为什么感觉有些空虚？"
    "七影蝶，迷途橘，空门家的职责……"
    "一个个名词和概念盘旋在脑海。"
    "还有什么没有做的事情吗？"
    "……想不出。"
    "既然明天早上就要离开了，那么先和大家道个别吧。"
    "我走向秘密基地。"
    scene bg006e with fade
    "天善和良一正在打乒乓球。"
    "良一" "哟。是羽依里啊。要不要来两局？"
    "羽依里" "……我是来道别的。我明天上午就要走了。"
    "良一" "这样啊。那么，来开送别会吧！"
    "羽依里" "不用了。"
    "羽依里" "况且现在开也来不及了。"
    "良一" "这样啊。那么，提前祝你一路顺风！"
    "羽依里" "啊，谢谢。"
    "天善" "特训的对手又要少一个了呢。可以请你最后来打一局吗？"
    "羽依里" "哦，可以啊。"
    "我拿起了旁边的球拍。"
    "乒乓的声音回荡在秘密基地中。"
    "我们沉默不语。"
    "虽然以后一定会回来，但这样的日常，却也即将变得遥不可及。"
    "我们相视无言。"
    "离别总是伤感的。"
    "因此，必须有人先打破沉默。"
    "羽依里" "那么，再见了。周末和放假我会再回来的！"
    scene bg008e with fade
    "离开秘密基地，我又和小岛上的其他人道了别。"
    scene bg019n1 with fade
    "回到家里，我收拾好了房间里的行李。"
    "羽依里" "最后一天了啊～真的有点舍不得呢。"
    "躺在床上，我认真思考了一下这股不舍中夹杂的空虚。"
    "羽依里" "果然还是因为她不在啊。"
    "不过，很快就释然了。"
    "因为，我还有必须要做的事情。"
    "也就是说，还有希望，不是吗？"
    "羽依里" "苍，等着我……"
    stop music fadeout 3.0
    "就这样进入了梦乡。"
    scene bg017a with fade
    show text "～August 30th～" at truecenter with dissolve
    pause 2.0
    scene bg017a with fade
    "八月三十日。"
    "返程的日子。"
    "和镜子阿姨道别后，我早早地来到了医院。"
    scene cg_ao04_0103 with fade
    play music "bgm/bgm16.ogg" fadein 2.0
    "蓝" "要走了吗？"
    "羽依里" "嗯。我下周会回来的。"
    scene cg_ao09_0201 with fade
    "羽依里" "苍，我走了。一定要等着我哦？"
    "羽依里" "绝对不可以自己抛下我哦？"
    "苍仍然熟睡着。"
    "蓝" "我有种直觉，苍可能短期内不会醒了。"
    "羽依里" "换句话说，长期还是有希望的。"
    "蓝" "但愿吧。我们也只能做我们该做的事情罢了。"
    "羽依里" "该做的事情吗……"
    "羽依里" "我明白了。那么，下次再见了！"
    scene bg010a with fade
    "离开医院，我走在了鸟白岛的小路上。"
    "还记得刚来的时候沿着这条路前行时的心情，夜晚迷路时的发现，山中的点点亮光。"
    "每一处都包含着这个暑假的记忆。"
    "羽依里" "感觉没怎么变呢。"
    "只是，行走的方向指向港口。"
    "正如每个故事都会走向终结，暑假也是一段有限的时光。"
    scene bg001a with fade
    "野美希" "羽依里！这里这里！"
    "在港口等船的我转头望去，只见一批人正在那里。"
    "镜子阿姨，良一，天善，野美希……甚至还有被野美希拖着的白羽。"
    "众人" "羽依里！来合影吧！"
    "野美希架好相机，顺利地拍了照片。"
    "羽依里" "谢谢你们……谢谢你们来为我送行。不过，我很快就会回来的。"
    scene bg001a1 with dissolve
    "广播" "请旅客们有序登船。"
    "羽依里" "再见了！"
    "在鸟白岛的港口，我们挥手告别。"
    "这个难忘的暑假结束了啊。"
    "现在，我终于明白如何面对暑假的终结。"
    "……留下“念想”，就不会难过。"
    "即使短暂，但只要留下目标，那么就永远不会失去方向。"
    "面对假期的消逝，就是如此。"
    "羽依里" "念念不忘，终有回响。"
    "不知为何，脑中突然蹦出来一句话。"
    "“终有回响”……是吗……"
    scene bg_kuro with fade
    show text "～September 1st～" at truecenter with dissolve
    pause 2.0
    scene bg_kuro with dissolve
    "新的学期开始了。"
    "熟悉的校园，熟悉的朋友……"
    "鸟白岛的点滴逐渐被埋藏到心灵深处。"
    "只留下了，一丝不可分割，永不消逝的情感。"
    "好似有一条虚无缥缈，又坚固不断的线，连接着我，和那个熟悉的地方。"
    stop music fadeout 3.0
    "……"
    "放学后，我来到了游泳社团。"
    play music "bgm/bgm99.ogg" fadein 2.0

    "羽依里" "各位，我回来了。抱歉让你们担心了。"
    "道歉之后，面对大家的挽留……"
    "羽依里" "很高兴能和大家度过那么一段游泳的时间，不过我已经决定退出了。"
    "羽依里" "我已经有了新的努力方向了。"
    "我已经，找到了人生中最重要的人和事……"
    "没错，只要完成那个目标，就能得到幸福了。"
    "离开社团之后，我便开始寻找一份合适的打工。"
    "便利店售货员？餐厅服务员？还是发传单呢？"
    "不过我都没有经验就是了，毕竟之前放学后都在参加社团活动。"
    "如果算的话，粗点心店打工算不算经验呢？"
    "希望在赚钱的同时，也留下点可以送给苍的回忆啊。"
    "走在路上，总感觉身旁有一股神秘又亲切的气息存在。"
    "是什么呢？"
    scene cg_ao12_0101 with fade
    "感觉这种东西，有时准确，有时却令人疑惑。"
    "我回顾四周。"
    scene bg_kuro with dissolve
    "除了几个陌生人，真的什么都没有。"
    "还是先专注于眼前的事物吧。"
    "前面，还有很长的路要走呢。"
    "我也要，努力才行。"
    "……"
    jump ch1_1
label ch1_1:
    play music "bgm/bgm01.ogg" fadein 2.0
    scene bg001a1 with fade
    show text "～September Week 1～" at truecenter with dissolve
    pause 2.0
    scene bg001a1 with fade
    "夏季的炎热仍未过去。"
    "时隔一周，我再次回到了鸟白岛。"
    "羽依里" "苍，我回来了！"
    "一旁的旅客投以怪异的目光。"
    scene bg009a with fade
    "……来到了医院。"
    show ai with dissolve
    "蓝" "羽依里！欢迎回来！"
    "羽依里" "我回来了。蓝已经可以下床活动了吗？"
    "蓝" "医生说恢复得很好，大概再过几个月就可以出院了。"
    "蓝正在做伸展运动。"
    "羽依里" "苍最近怎么样？"
    "蓝" "还是先前的状态……"
    "也是，毕竟记忆还没有找回来。"
    scene cg_ao09_0103 with dissolve
    stop music fadeout 2.0
    "病房里的空调提供着令人舒适的温度。"
    "我放下书包，突然想起临行前特意放进包里的东西。"
    "羽依里" "这是课本和我家里的一些藏书。"
    "蓝" "嗯。谢谢了，我会给苍朗读的。"
    "蓝" "嗯？等等，这个是……？"
    "只见一些教科书中，夹着一本令人眼熟的东西。"
    play music "bgm/bgm36.ogg" fadein 2.0
    "蓝手中拿着的是……这不是我正在读的同人志吗！？"
    "羽依里" "啊啊啊不是，那个是拿错了……"
    "蓝" "哦？R－18？我没收了。羽依里还没满18岁吧？"
    "……看来下次这种东西还是藏好点吧。"
    stop music fadeout 3.0
    "苍" "阿嚏！哈……"
    "转头望去，苍的被子已经有一半落到床下了。"
    play music "bgm/bgm10.ogg" fadein 2.0
    "帮她盖好吧。"
    scene cg_ao09_0201 with dissolve
    "羽依里" "要好好睡觉……感冒了可就不好了……"
    "羽依里" "苍，我已经找到打工的地方了哦。虽然辛苦，但是没关系的。我每周都会来的……"
    "一周的经历如潮水般奔涌而出。"
    "希望这记忆的洪流，能在苍心中留下一点点回忆吧。"
    "羽依里" "这就是这周发生的事情了。苍，明天见。"
    "我和蓝相视一笑，告别了这家医院。"
    stop music fadeout 3.0
    scene bg009a with fade
    "外面的天气仍然和八月份没什么区别。"
    play music "bgm/bgm04.ogg" fadein 3.0
    "接下来的几天，要干什么呢？"
    "后天就要回去了，得抓紧时间了。"
    "……回程？"
    "不对，现在有一件更紧急的事情。"
    "今天是周五，我必须在后天下午前攒够钱，来买回程的船票。"
    "下意识摸了摸口袋。"
    "1000 日元。"
    "只有 1000 日元啊。"
    "该怎么做呢？"
    menu:
        "打工":
            jump ch1_1_c1
        "捡垃圾":
            jump ch1_1_c2
        "借钱":
            jump ch1_1_c3
label ch1_1_c1:
    "羽依里" "还是靠最朴实的方法吧。"
    scene bg002a with fade
    "羽依里" "说到打工，也只有这里了吧。"
    "来到了粗点心店。"
    "老奶奶" "欢迎光临。这不是小苍的熟人吗？要买点什么？"
    "羽依里" "其实，我不是来买东西的。"
    "老奶奶" "是来替小苍看店的吗？"
    "羽依里" "是……不，也不是。"
    "老奶奶" "？？？"
    "羽依里" "其实，是想来打工赚钱的。"
    "老奶奶" "哦？那么你要这盒糕点还是薯片？还是要和小苍一样的东西？"
    "老奶奶以笑脸相迎。"
    "羽依里" "啊，那就薯片吧。"
    "和糕点相比，薯片很好吃……"
    "不对，我在想什么啊！"
    "看到老奶奶的笑容，根本就没办法拒绝了！面对这样的老奶奶要怎么把拿钱说出口嘛！"
    "本来想看店一会儿之后就鼓起勇气对老奶奶说出实话，不过老奶奶把店托付给我之后，就走了……"
    scene bg002e with dissolve
    "结果直到关店，只带了几罐薯片回家……"
    jump ch1_2
label ch1_1_c2:
    scene bg402a with fade
    "来到了灯塔旁边。"
    "……似乎、有点安静啊？"
    "紬不在吗？"
    "长椅上摆放着一个个玩偶。"
    "似乎……曾经发生过什么重要的事情。"
    "是什么呢？"
    "但是，直觉告诉我，这与现在的我已经无关了。"
    "开始捡垃圾吧。"
    "……"
    "一个下午过去了，赚到的钱……只够买份晚饭。"
    jump ch1_2
label ch1_1_c3:
    scene bg006a with fade
    "来到了秘密基地。"
    "良一" "哟，这不是羽依里吗～你回来啦！"
    "天善" "要来局乒乓球吗？"
    "羽依里" "其实，我遇到了一点小困境。"
    "良一" "哦？是什么呢？"
    "羽依里" "我没钱买回程的船票了。"
    "良一" "我来帮你……欸？"
    "羽依里" "我已经走投无路了……"
    "良一" "你这已经不是‘小’困境了吧。对了，我曾经有一个大胆的想法来赚钱，要听吗？"
    "羽依里" "你说吧。"
    "虽然大概率没什么用就是了。"
    "良一" "去粗点心店进货，然后高价卖出！"
    "羽依里" "别人都知道你的价格比较高吧。毕竟粗点心店不是岛上知名的店铺吗？"
    "良一" "不不不，我们只要把店里的东西买空，不就行了？"
    "听起来似乎可行。"
    "羽依里" "不过，你哪里找那么多钱？"
    "良一" "……是哦。嘿嘿。"
    "算了，还是我自己想想办法吧。"
    "虽然良一还想出一些主意，不过被我拒绝了。"
    "良一" "那么，你一个人加油啊！"
    "离开了秘密基地。"
    "什么都没赚到。"
    jump ch1_2
label ch1_2:
    stop music fadeout 3.0
    scene bg008e with fade
    "虽然不是很想这么做，但是一进家门，我还是向镜子阿姨求助了。"
    "镜子" "羽依里！？你怎么回来了！"
    "羽依里" "嗯，我回来了……关于为什么回来，其实说来话长……"
    "镜子" "啊，那么进来慢慢说吧。"
    scene bg017e with dissolve
    play music "bgm/bgm08.ogg" fadein 3.0
    "进屋坐到了沙发上，我仔细斟酌着话语。"
    "……毕竟这种事情有些超现实。"
    "羽依里" "这次回来，是来看苍的。"
    "镜子" "啊～是羽依里的恋人吗？"
    "事到如今，也没有其他选择了！"
    "羽依里" "嗯。我就是来探望她的。"
    "镜子" "啊，这件事已经在岛上传开了呢。"
    "镜子" "不过，到底是为什么迟迟不醒来呢？"
    "啊，那个蝴蝶标本我还带着。"
    "就拿这个解释吧。"
    "镜子阿姨全程面带笑容地听着我的讲述，似乎早已看透一切。"
    "羽依里" "大概就是这样。"
    "镜子" "看来，羽依里在暑假里有了一段很有意思的经历呢。那么我也就放心了。"
    "羽依里" "不过，我现在遇到了一点问题，我没钱买回去的船票了。"
    "镜子" "啊，没事没事，仓库里不重要的东西本来就卖出去一部分了，有不少钱哦。"
    "羽依里" "我真的可以拿吗？"
    "镜子" "本来就是羽依里的那部分哦～作为帮忙整理的工钱。"
    "虽然我这个暑假什么也没做就是了。"
    "羽依里" "那么我就不客气地收下了。"
    "看来，问题似乎解决了。"
    "羽依里" "我出门了～"
    "解决作业后，我百无聊赖地走出了家门。"
    scene bg008n with dissolve
    "就如来到岛上的第一个夜晚一样，漫无目的地在岛上闲逛。"
    "毕竟居民区有着几盏路灯，也不至于摔倒。"
    "脑海里突然冒出一个想法。"
    "做点恋人该做的事情吧。"
    "和苍一起度过一晚。"
    "脚步不知不觉变更了方向。"
    scene bg009n with dissolve
    "回过神来时，已经到了医院的门口。"
    scene cg_ao09_0103 with dissolve
    stop music fadeout 3.0
    "已经是深夜了，对前台的护士表明身份之后，没有敲门便悄悄进入病房。"
    "蓝已经睡着了啊。"
    "一旁的苍一如既往地沉睡着。"
    "不过，被子似乎再次落了下来。"
    "要怎么做呢？"
    menu:
        "帮她盖好被子":
            jump ch1_2_c1
        "钻进去一起睡":
            scene cg_ao09_0201 with dissolve
            play music "bgm/bgm35.ogg" fadein 3.0
            jump ch1_2_c2
label ch1_2_c1:
    "羽依里" "苍，睡觉要好好睡哦。"
    scene cg_ao09_0201 with dissolve
    "帮苍盖好了被子。"
    "摊开旁边的折叠床，默默守护在苍的身旁。"
    "这是我现在唯一能做的事情了。"
    "我知道，她就在那里，不会离去。"
    "不过，一想到身边睡着两个美少女，又有些激动。"
    "有什么声音。"
    scene cg_ao09_0103 with dissolve
    "苍的被子似乎被她在睡梦中拉了下来。"
    "上半身一览无余。"
    "‘好想和她在一起。’"
    "脑海中突然蹦出一个念头。"
    play music "bgm/bgm35.ogg" fadein 3.0
    "我站起来，偷偷亲了苍那水灵的嘴唇。"
    "一个大胆的想法在脑中产生。"
    jump ch1_2_c2
label ch1_2_c2:
    "脱掉外套之后，我偷偷爬进了苍的被窝。"
    "面前的苍不知为何，突然动了起来。"
    "她把我紧紧抱在怀里，根本不给我任何挣脱的机会。"
    "羽依里" "唔唔唔！？"
    "整个脸都被苍的某个部位包裹住了！"
    "我拼命挣扎，露出了鼻孔来呼吸。"
    "虽然那个地方很柔软，不过差点被闷死。"
    "‘死里逃生’的我试图把一半落在地上的被子拉上来，却发现我根本动不了。"
    "苍" "羽依里，不要走……不要……"
    "耳畔传来朦胧的低语，身上的束缚又增添了几分力道。"
    "不过，这样也挺不错的，不是吗？"
    stop music fadeout 3.0
    play music "bgm/bgm28b.ogg" fadein 3.0
    "我细细体会着小苍的体温，同时为她因外露而微凉的身体提供热量。"
    "窗外吹来了一阵风。"
    "我抱紧了苍。"
    "一阵阵暖流正逐渐流过两个人的全身。"
    "苍微微放松了警惕，我也得以自由呼吸。"
    "羽依里" "哈……呼……"
    "大口喘气的同时，突然意识到刚覆盖在我的脸上的东西，似乎是……"
    "两座大山？"
    "……"
    "赶紧移动了一下头部，避开了这个柔软的部分。"
    "和苍在一起，似乎有一种特殊的安心感。"
    "虽然已经有过好几次了，不过抱住女孩子的身体，每次都能带来不一样的体验。"
    "想永远能和苍呆在一起，每晚搂着她入睡。"
    "虽然今晚已经冲动做了这种事情……"
    "但眼下最重要的事情，还是让苍醒过来啊。"
    "我逐渐进入了梦乡……"
    "……"
    stop music fadeout 3.0
    "清晨的阳光照入病房。"
    "阳光被什么东西挡住了。"
    "我睁开了眼睛。"
    "面前是苍那熟悉的睡脸。"
    play music "bgm/bgm24.ogg" fadein 3.0
    "不过，似乎有一个黑影挡住了阳光。"
    "脊背升起一股凉意。"
    "我勉强转过头去，和蓝的目光相撞。"
    play music "bgm/bgm35.ogg" fadeout 3.0 fadein 3.0
    scene cg_ao04_0206 with fade
    "蓝" "哟，你们的感情还真好啊～"
    "羽依里" "不是不是，那个听我解释……"
    "我试图先从苍的怀里挣脱出来，再找点什么借口。"
    "结果苍抱得更紧了。"
    "苍" "呜呜，羽依里……不要嘛……"
    "这家伙到底是为什么突然变成这样的啊？"
    "蓝" "哼，罢了，我就不打扰二位了。"
    "蓝" "啊~毕竟总有一天苍要嫁出去的，先熟悉一下也不错。"
    "羽依里" "谢……谢谢？"
    "完全不知道应该说什么……"
    scene cg_ao04_0205 with dissolve
    "蓝" "谢什么谢啊！你把苍抢走了知道吗！？"
    "……"
    "羽依里" "嗯……可以请你帮我把她拉开吗？"
    "蓝" "……自己来！"
    "……"
    "花了好大力气才挣脱。"
    stop music fadeout 3.0
    "直到我离开病房，蓝都呆呆地望着窗外。"
    "下次给她带点什么有意思的东西好了。"
    jump ch1_3
label ch1_3:
    scene bg009a with fade
    "好了，接下来做什么呢？"
    "百无聊赖地在岛上闲逛。"
    play music "bgm/bgm07.ogg" fadein 1.0
    "我到底是来干什么的啊？"
    "明明时间是那么宝贵的东西……"
    "好，那就珍惜一下时间吧！"
    scene bg019a with dissolve
    "回到家里，打开课本开始学习。"
    "早上精神就是好啊，竟然涌起了学习的欲望。"
    "……"
    window hide
    scene bg_kuro with wipedown
    scene bg019a with wipeup
    window auto
    "羽依里" "哈……啊！已经中午了吗！？"
    "刚才还说精神好！？明明马上就睡着了啊！"
    "算了，事已至此，先吃饭吧。"
    stop music fadeout 1.0
    scene bg017a with dissolve
    "……？"
    "不对。"
    play music "bgm/bgm24.ogg" fadein 0.5
    "为什么我会自动坐到客厅的桌子前呢？"
    "明明上面空空如也。"
    "说起来，昨天来这里的时候就觉得有些奇怪了。"
    "为什么……客厅里有{=red_highlight}3张坐垫{/red_highlight}呢？"
    "为什么厨房里，有{=red_highlight}3双筷子{/red_highlight}放在外面？"
    "为什么，我的房间旁边，还有{=red_highlight}一间看起来有人居住的房间{/red_highlight}？"
    "我、镜子阿姨，不应该是{=red_highlight}2个人{/red_highlight}吗？"
    "整个暑假好像{=red_highlight}都是如此{/red_highlight}啊？"
    "不，不对，我好像忘掉了什么很重要的东西。"
    "似乎连{=red_highlight}遗忘本身{/red_highlight}都要忘却了。"
    "啊！好像有{=red_highlight}一张纸条{/red_highlight}……"
    "那是过去的自己留下的提示，是重要的东西。"
    scene bg019a with dissolve
    "我奔回房间，试图寻找到它。"
    "什么都没有。"
    "垃圾桶也被清空了。"
    "最后一缕思绪消失在了脑海。"
    stop music fadeout 2.0
    "我……在做什么来着？"
    "啊，对了，我要先去食堂吃饭。"
    scene bg_kuro with fade
    play music "bgm/bgm15.ogg" fadein 2.0
    "……"
    show text "时间是线性的。" at truecenter with dissolve
    ""
    show text "在当前做的选择，会影响到{=red_highlight}后面的发展{/red_highlight}。" at truecenter with dissolve
    ""
    "有点像{=red_highlight}GalGame{/red_highlight}，是不是？"
    "那么我们作为时间线中的人，是世界的控制者吗？"
    "或许是吧。"
    "只是我们不能存档，回溯罢了……"
    "真的不能吗？"
    show text "除非有{=red_highlight}一种能力{/red_highlight}……" at truecenter with dissolve
    ""
    "……"
    stop music fadeout 2.0
    scene cg_ao09_0201 with fade
    play music "bgm/bgm01.ogg" fadein 1.5
    "鸟白岛的下午。"
    "下午也继续陪在苍身边。"
    "绞尽脑汁却说不出一个字来。"
    "蓝" "明明陪着她，却一句话也不说……"
    "蓝" "啊，吵架也是情侣间学会相处的必要部分啊。"
    "抬头和做完了身体活动的蓝对上了视线……"
    "羽依里" "苍还没醒呢！不要默认我是个得了妄想症的疯子好吗！"
    "羽依里" "对了，可以带苍出去走走吗？"
    "羽依里" "我去和医生说说吧。"
    "医生" "哦，是苍的恋人啊。"
    "羽依里" "……"
    "羽依里" "可以带苍出去吗？"
    "医生" "可以啊，看她这样也没什么身体问题，轮椅在那边……"
    "医生" "哦对了，如果想经常带她出去的话，建议你自己买个轮椅哦。"
    "医生" "毕竟……医院的轮椅已经有些破了……万一散架了还要麻烦你把她背回来。"
    "羽依里" "好的。"
    "把轮椅加入购物清单吧。"
    "医生" "啊对了，不要离开医院太远哦。尽量往大路上推。"
    "羽依里" "明白了！"
    "走吧。"
    "是时候踏上新的旅途了。"
    scene bg009a with fade
    "我要带着苍，一起游览这个给我们留下一个暑假回忆的地方。"
    "去找到吧，那些美好的回忆——"
    scene bg_kuro with fade
    stop music fadeout 3.0
    "……"
    "有人认为，平行世界是存在的。"
    "当你在一条时间线上做出一种选择，在同一个时间点的另一个你可能做出另一种选择。"
    "选择可以决定时间线发展。"
    "所以就产生了树枝状的结构。"
    "啊，就是GalGame里的树状图。"
    "一般来说，树枝不会碰撞。"
    "但万一……有外力把树枝折了一下呢？"
    "时间线发生了交错……"
    "那么，不属于这个世界的东西，就会出现……"
    "……"
    scene bg009a with fade
    show text "～October Week 1～" at truecenter with dissolve
    pause 2.0
    scene bg009a with fade
    play music "bgm/bgm07.ogg" fadein 3.0
    "入秋了。"
    show ai with dissolve
    "蓝的身体似乎正在恢复，已经能够在医院内自由走动了。"
    "过一段时间估计就可以出院了吧。"
    "今天也带苍出去走走吧。"
    scene bg011a with fade
    "推着轮椅走到了一处陌生由熟悉的地方。"
    "上山的入口处，一阵秋风吹过。"
    "羽依里" "好久没有去看过迷途橘了。"
    "鬼使神差般的，我背上了轮椅上的苍。"
    "当然，她一点也没有要醒来的样子。"
    "或许是退出社团的缘故，总觉得背着苍变得更累了。"
    "走到半路上已是大汗淋漓。"
    "在这里休息一下吧。"
    scene cg_ao05_0103 with fade
    "放下背上的苍，我用背部支撑着她坐了下来。"
    "羽依里" "还记得吗？当初我们一起找蝴蝶的时候，也是这样的情形呢。"
    "苍并没有回应。"
    "我想象了一下她的回复。"
    "苍" "是啊。"
    "不不不，太平淡了点吧。"
    "好吧，我承认也没什么想象力……"
    "羽依里" "好！我们继续走吧！"
    scene bg202a1 with fade
    "大块空地上，迷途橘静静地等待在那里。"
    if ending == 1:
        jump end_1
    else:
        jump ch1_4
label end_1:
    stop music fadeout 1.0
    "这时，一个光亮的东西慢慢落到了我的手边。"
    "是一只七影蝶。"
    "我心里一紧，伸出了手……"
    "然而，蝴蝶飞走了。"
    "羽依里" "怎么回事？"
    "羽依里" "啊，山之祭祀的时间已经过了。"
    "脑中突然冒出一个想法。"
    "一个可能性很小，但却十分重要的猜想。"
    play music "bgm/bgm28.ogg" fadein 1.0
    "羽依里" "等等！别走！等等我！"
    show bs happy with ease:
        xoffset 700
        yoffset 700
    "稻荷" "蹦——蹦——"
    "身边的稻荷跳了出去。"
    "羽依里" "不可以！等等！把你的记忆给我看啊！！！"
    "我跑了过去……"
    "伸出我的双手——"
    "但七影蝶擦手而过。"
    "羽依里" "不要走！！！"
    "七影蝶消失了。"
    "我什么都没看到。"
    "为什么啊！"
    hide bs with ease
    "这时，我的身旁突然聚集了一群七影蝶……"
    "？？？" "时间是线性的。"
    "？？？" "这句话，可没人能证明哦~"
    "？？？" "在走之前，把我的记忆，给你看看吧。"
    "脑中突然涌出了巨量的信息。"
    "白羽、羽末……"
    "羽末？海己？女儿？"
    "这都是什么啊！"
    "羽依里" "我不承认！这不是我的记忆！"
    "？？？" "那么，看看这个吧。"
    "羽末为了拯救自己的母亲，回到了羽依里和白羽相遇的鸟白岛。"
    "？？？" "你已经，满足了吧？"
    "羽末" "是时候，去见妈妈了……"
    "新的夏日冒险，开始了——"
    show text "～BAD END 新的轮回～" at truecenter with dissolve
    pause 2.0
    return
label ch1_4:
    "啊，突然想起来之前把书放在这里了来着。"
    "趁着这个机会，把书读给苍听听吧。"
    "羽依里" "啊！找到了！"
    "但是，感觉有点奇怪啊？"
    stop music fadeout 3.0
    "这本书有这么薄吗？"
    "轻轻抹去上面的泥土，一串文字映入眼帘——"
    play music "bgm/bgm37.ogg" fadein 1.0
    "ALKA TALE"
    "羽依里" "这是……什么东西？"
    "打开它的一瞬间，似乎有什么东西永远地消失了。"
    "耳边似乎传来什么声音。"
    "？？？" "再见，▯▯。祝▯们▯福。"
    "？？？" "我已▯▯足了，是▯▯走了。"
    "？？？" "我▯，▯会▯见吗？"
    "一个特殊的名字，羽末，留在了脑海中。"
    "虽然只有一瞬间，立刻就抛之脑后了。"
    "手中只是一本普通的日记本而已。"
    "大片的空白。"
    "一定是哪个孩子把它埋在这里的吧。"
    "或许那本古书译本，被某个喜欢探险的孩子挖走了。"
    "下次找镜子阿姨再翻译一遍吧。"
    "这次一定要去复印店做个备份！"
    scene bg011e with fade
    "抬头一看，夕阳已经染红了天空。"
    "啊，已经那么晚了啊。"
    "该走了，否则医院可能就要来找人了。"
    "背起熟睡的苍，一口气走到了山脚的轮椅旁……"
    scene bg009a with fade
    show text "～November Week1～" at truecenter with dissolve
    pause 2.0
    scene bg009a with fade
    play music "bgm/bgm01.ogg" fadein 2.0
    show ai with dissolve
    "医院的门口。"
    "蓝、空门家的母亲和我正庆祝着蓝出院的时刻。"
    "虽然暂时无法跑跳，但是她至少能够一个人正常生活了。"
    "空门母亲" "那么，苍和蓝就拜托你了～"
    "好像是有什么急事，她先离开了……"
    "蓝在住院的两个月里已经自学了小学小学的课本，接下来准备学习初中知识，准备明年去试一试升学考试。"
    "竟然两个月学了小学5年的内容……虽说确实在睡着的时候听了苍的话……"
    "但要达到这样的程度，这家伙绝对是天才吧。"
    "蓝" "对了，我拜托了医生，现在病人比较少，如果旁边床位没人你是可以陪小苍过夜的。"
    "羽依里" "谢了，那么今天我就来陪苍吧。"
    "蓝" "……"
    "羽依里" "？"
    "蓝" "……"
    "羽依里" "不不不，绝对不是上次的那种，我睡旁边啦！旁边！"
    "蓝" "……"
    "蓝的表情好像不太对。"
    "好像有种欲言又止的感觉。"
    "……医院门口人来人往。"
    "蓝" "我们借一步说话。"
    scene bg003a with fade
    "我们来到了一旁窄窄的小巷里。"
    "这里一个人也没有，是绝佳的隐蔽地点。"
    show ai with dissolve
    "蓝" "羽依里。"
    "羽依里" "在！……怎么突然这么认真。"
    "蓝" "我想提一个任性的要求，可以吗？"
    "羽依里" "什么要求？"
    "蓝" "可以请你在接下来的一段时间里，和我一起晚上上山吗？"
    "蓝" "毕竟已经10年了，或许山路也变了……"
    hide ai
    show ai with dissolve
    "蓝" "可以请你在暑假前，和我一起上山吗？"
    "羽依里" "是想找苍的七影蝶吗？"
    "蓝" "虽然概率很小，但或许，小苍的记忆现在正在等着呢。"
    "羽依里" "那么，我自己去也是可以的。蓝不是看不见七影蝶吗？"
    "羽依里" "既然是我和苍的约定，我一定要负起责任。"
    "蓝" "但是，我也想救小苍……或许小苍的蝴蝶现在只有我才能看到……或许现在小苍正在山上等着我们……"
    "羽依里" "可是，蓝现在这样去还是太危险了吧。"
    "羽依里" "蓝要做的就是好好恢复，我相信小苍也不愿意看到你再次受伤。"
    "蓝" "我明白了。那么，请至少允许我在完全恢复的时候和你一起上山吧。"
    "……"
    stop music
    scene cg_ao09_0103 with fade
    "当天晚上，我住在了医院。"
    "躺在小苍旁边的病床上。"
    "羽依里" "晚安。"
    scene bg202a1 with fade
    play music "bgm/bgm27.ogg" fadein 2.0
    "……"
    "这是哪里呢？"
    "这里感受不到时间的流逝。"
    "我试图低下头，却发现“我”根本不存在。"
    "这里是一片无边的绿色草原。"
    "我是谁？我来自哪里？又将去往何方？"
    "不，不对。"
    "我还有重要的责任。"
    "还有重要的人在等我。"
    "是谁？"
    "……想不起来。"
    show ao com_stand eye_closed_smile with dissolve
    "面前躺着的是一个少女。"
    "她是谁？"
    "蓝紫色的长发……深绿色的短裙……"
    "发饰上的那个，是叫做蜻蜓玉吧？"
    "……为什么我会知道它的名字？"
    "而且，我很确定它对我有非同一般的意义。"
    "这和我到底有什么联系？"
    "重要的人又是谁？"
    "快想起来——给我想起来啊——！"
    "他还在等我——！"
    "“他”？"
    "“他”……他是谁？"
    hide ao with dissolve
    "眼前出现了一颗树……"
    "于此同时，女孩消失了。"
    scene bg999a with fade
    "我突然离开地面，升入了高空。"
    "我感觉我自己正在消散。"
    "到此为止了吗……"
    "即使是自己的曾经拥有的记忆，面对遗忘也无能为力吗？"
    "为什么会遗忘，为什么我对自己一无所知？"
    "耳边突然传来什么声音。"
    "那声音无比渺小……小到似乎根本无法听清那句话。"
    "但是，我听见了。"
    "我清清楚楚地听见了。"
    "？？？" "▯！我真的，非常非常喜欢你啊！"
    "？？？" "跟你在一起的时光，是最幸福的啊！"
    "？？？" "▯！回来吧！"
    "内心仿佛受到了召唤。"
    "视野突然变换方向。"
    scene bg904a at Position(yoffset=200) with fade 
    "下面……是一座岛？"
    "我回到了那里。"
    "我回到了……那个熟悉的地方。"
    "……"
    stop music fadeout 2.0
    scene cg_ao09_0102 with fade
    "羽依里" "唔……现在是几点？"
    "我做了一个梦。"
    play music "bgm/bgm12.ogg" fadein 2.0
    "似乎是个美梦呢。"
    "直到睡醒，脸上都洋溢着笑容。"
    "梦的内容我记不清了。"
    "但好像和苍有关？"
    "或许是太喜欢苍了。"
    "今天下午我也该回去了，回家整理一下东西吧。"
    stop music fadeout 2.0
    "……"
    scene bg011n with fade
    "后来，我经常带着稻荷上山去寻找，却终究没有找到苍的七影蝶。"
    "稻荷似乎已经完全明白了我想要做什么，看到七影蝶时便会紧紧咬着我的裤腿把我拉开，我也因此不需要自己一个个确认。"
    "时间，正向着第二个夏天流逝。"
    scene bg009e with fade
    show text "～December Week 4～" at truecenter with dissolve
    pause 2.0
    scene bg009a with fade
    play music "bgm/bgm04.ogg" fadein 2.0
    "圣诞节到了。"
    "鸟白岛上虽然没有下起雪，阵阵冷风却吹得我身体发抖。"
    "我提着行李走在那条熟悉的小路上。"
    "前面有个人影依稀可见。"
    show ai with dissolve
    "紫色的头发，那是蓝吗？"
    hide ai with dissolve
    "我加快了脚步，但前方的人抢先一步，走入了医院。"
    "我也赶紧进去吧。"
    scene cg_ao09_0103 with fade
    "登记好之后，我来到了苍的房间。"
    "房间里开着空调，提供了舒适的温度。"
    "蓝已经等在那里了。"
    "羽依里" "今天是圣诞节哦，这是给你的礼物。"
    "蓝" "给我的？"
    "我从包里拿出一条紫色的围巾。"
    "羽依里" "是蓝的头发的颜色哦。"
    "蓝接过我手中的围巾，试着戴到自己脖子上。"
    "羽依里" "怎么样，你觉得好看吗？"
    "蓝转向镜子。"
    "蓝" "好看，而且很暖和，谢谢。"
    "蓝" "苍也有礼物吗？"
    "羽依里" "当然啦，是这个。"
    "我从口袋里掏出一个遥控器。"
    "蓝" "这是什么啊？"
    "羽依里" "轮椅的遥控器。"
    "蓝" "？"
    "羽依里" "我买了电动轮椅哦。已经托人送到这家医院了。"
    "蓝" "这么冷的天，苍也不太好出去吧？"
    "羽依里" "那就等天气暖和起来再带她出去吧。"
    "我坐到小苍的床边。"
    "羽依里" "苍，这周过得怎么样？"
    "苍" "……"
    "羽依里" "很开心是吗。今天是圣诞节哦，我们晚上一起庆祝吧。"
    "抓起苍的手。"
    "是一只没有一丝力道的手。"
    "再过几个月，或许就能相见了。"
    "如此期待着。"
    "羽依里" "苍感觉变白了呢。是太久没晒太阳了吗？"
    "苍" "……"
    "即使知道不会有回应，我却仍然努力地寻找话题。"
    "苍" "嗯……嗯嗯？"
    "她突然轻微发出了些声音，嘴角微微上扬。"
    "蓝" "最近她都是这样，不知道为什么。"
    "羽依里" "或许是做了什么美梦吧。"
    "蓝" "苍不会梦到你了吧。"
    "羽依里" "有没有可能，她只是饿了。"
    "蓝" "这才刚下午……饿了？"
    "羽依里" "开玩笑的。"
    "总之，今天是圣诞节，一定要开心地度过。"
    "距离晚上还早着，我打算先回家一趟。"
    "毕竟，还有很重要的惊喜需要准备呢。"
    "给蓝递了一个眼神，我便离开了病房，朝着加藤家走去。"
    stop music fadeout 0.5
    scene bg008a with fade
    "镜子" "欢迎回来，羽依里。那个已经准备好了哦。"
    play music "bgm/bgm14.ogg" fadein 0.5
    scene bg017a with fade
    "羽依里" "啊啊，在那里呢。谢谢您。"
    "家里的客厅里，摆着一件显眼的服装。"
    "是一套圣诞老人的 Cosplay 服装。"
    "镜子" "这个可能有点热，现在冬天的话，羽依里就没必要穿外套了哦。"
    "我根据镜子阿姨的指示，穿上了这套衣服。"
    "镜子" "是真的圣诞老人呢~"
    "我来到卫生间，向镜子里望去……"
    "这个体型真的很还原呢。"
    scene bg008a with fade
    "一切准备就绪，我拿着包在礼物盒里的轮椅遥控器向医院走去。"
    "说起来，这样还真的有些羞耻呢。"
    "在医院里，绝对会成为所有人目光的焦点的吧。"
    "——但实际上，问题出现得更早。"
    scene bg002a with fade
    "孩子们" "快看，是圣诞老人欸！"
    "镇上玩耍的孩子们，看到新奇的事物一如既往地有兴趣。"
    "孩子们" "是来给我们送礼物的吗！"
    "他们将我团团围住。"
    "孩子们" "说起来，今天就是圣诞节欸！"
    "孩子们" "手里拿着的是给我们的礼物吗！"
    "得想想办法，摆脱他们。"
    menu:
        "是路西法哦":
            jump ch1_4_c1
        "是折断了螺旋桨的直升机":
            jump ch1_4_c2
label ch1_4_c1:
    "羽依里" "是路西法哦。"
    "孩子们" "是路西法呢。"
    "羽依里" "……"
    "孩子们" "扮成圣诞老人了呢。"
    "羽依里" "……"
    "孩子们" "……"
    "对于我突兀的发言，似乎所有人大脑都短路了。"
    "不知道等了多久，终于有人打破了僵局。"
    "岛上的少女A" "……嗯，大家快看，有飞机欸。"
    "孩子们" "哪里！？"
    "一群人向少女指向的那个地方跑走了。"
    "羽依里" "行吧。结果上来说成功了……"
    jump ch1_5
label ch1_4_c2:
    "羽依里" "是折断了螺旋桨的直升机。"
    "孩子们" "？？？"
    "羽依里" "就是，坏掉的，直升机……"
    "孩子们" "哇……这个人是不是精神不正常啊。"
    "几个孩子后退了一步。"
    "羽依里" "欸？"
    "看来他们似乎还没有认出我来，赶紧趁机跑掉吧。"
    jump ch1_5
label ch1_5:
    stop music fadeout 0.5
    scene bg009e with fade
    "羽依里" "总之，继续向医院前进吧。"
    scene cg_ao09_0102 with fade
    "无视掉医院外和大厅里的异样目光，径直走进了苍的病房。"
    play music "bgm/bgm23.ogg" fadein 0.5
    "蓝" "欢迎回来。"
    "我走到苍的病床前，把那份礼物放到枕头旁边。"
    "羽依里" "苍，这是圣诞礼物哦。"
    "苍仍然闭着那双眼睛。"
    "睡脸还是很好看啊。"
    "内心突然涌起一股冲动。"
    transform zoom_head:
        linear 3.0 zoom 1.5 offset(200,400)
    transform recover:
        linear 1.0 zoom 1.0 offset(0,0)
    show cg_ao09_0102 at zoom_head
    "然后……"
    "双唇的距离越来越近。"
    "不知道哪里来的勇气，在蓝的注视下，我做出了如此大胆的举动。"
    "蓝" "喂。"
    "蓝" "在这里唧唧我我不太合适吧。"
    show cg_ao09_0102 at recover
    "怎么回事呢。"
    "我对苍的爱突然就无法抑制了。"
    "羽依里" "对，对不起。"
    "蓝" "是欲望压抑太久了？"
    "羽依里" "……"
    "说真的，这几个月来，我根本就没有和苍独处的时间，也更没有机会做那些恋人间该做的事情。"
    "坐在一旁的蓝对我笑了笑。"
    "蓝" "那，我先去买点东西~你们请自便~"
    "她悄悄走到我的旁边，小声贴在我耳朵上……"
    "蓝" "苍就拜托你了。"
    "结果，只剩下两个人的时候，我突然没有了勇气。"
    "毕竟苍还在睡觉，也不知道她本人是否愿意。"
    "总之，接吻这种事还是等她醒了再说吧。虽然之前在山上早就做过了……"
    "不得不承认刚才确实太冲动了。"
    "不过这样“辜负”蓝的“期待”好像也不太好。"
    "于是掀开苍的被子躺了进去。"
    show cg_ao09_0102 at zoom_head
    "贴到苍身上的那一刻，我立刻后悔了。"
    "这个举动，似乎比接吻还要大胆啊。"
    "苍身上的香味刺激着我的神经。"
    "已经无法保持理智了。"
    transform zoom_extra:
        linear 3.0 zoom 1.8 offset(200,400)
    show cg_ao09_0102 at zoom_extra
    "我紧紧抱着她，感受着苍的温度。"
    "很熟悉的感觉。"
    "之前在山上早已体验过。"
    "不过这一次似乎更加温暖。"
    "甚至让我产生了在母亲怀里的错觉。"
    "迷迷糊糊地，睡着了。"
    scene bg_kuro with dissolve
    stop music fadeout 0.5
    "等到意识恢复的时候，已经是晚上了。"
    scene cg_ao09_0102
    show cg_ao09_0102 at zoom_extra
    play music "bgm/bgm14.ogg" fadein 0.5
    "蓝" "哟，醒啦。"
    
    "苍和我正紧紧抱在一起。"
    "羽依里" "欸！？"
    "蓝" "没事的，再多抱一会也没关系。"
    "蓝" "你们做什么都没关系。没……关系的。苍已经是羽依里的了。"
    "这是没关系的语气吗！？"
    "经过了一些挣扎，终于从苍的怀里挣脱出来。"
    show cg_ao09_0102 at recover
    "就这样，度过了一个奇妙的圣诞节。"
    stop music fadeout 2.0
    scene cg_ao09_0103 with fade
    play music "bgm/bgm15.ogg" fadein 0.5
    "在此之后，时光不断前进着。"
    "我握着苍的手，走过了除夕、元旦。"
    "然后进入了新的一年。"
    "情人节那天，我买了巧克力，用苍的手指喂自己吃了下去。"
    "虽然和稻荷上山过几次，苍的七影蝶终究还是没有出现。"
    "也是，即使出现了，也没办法吸引过来。"
    scene bg904a at Position(yoffset=200) with fade 
    "就这样，夏天再次到来了。"
    scene bg202n with fade
    show text "～July 26th～" at truecenter with dissolve
    pause 2.0
    scene bg202n with fade
    "羽依里" "好了，开始吧。"
    show bs happy with dissolve
    "我从神龛里，取出那盏提灯，拂去上面的灰尘。"
    show bs happy with ease:
        xoffset -200
    show ai with dissolve:
        xalign 0.8
    "稻荷在前面带路，而蓝则跟在我的后面。"
    "我们的夏日冒险，再次开始了——"
    stop music fadeout 2.0
    jump ch2_1
label ch2_1:
    scene bg011n with fade
    play music "bgm/bgm28b.ogg" fadein 0.5
    "拿着不知从哪里找来的谜之草稿纸，再次拜托镜子阿姨抄一遍古书之后，我和蓝一起上了山。"
    "——会发光的蝴蝶。"
    "一路上，七影蝶藏在山路的各个角落。"
    "每当一只蝴蝶出现，我的内心总会一动，驱使着我向它移动。"
    show bs happy with dissolve
    "稻荷" "蹦——"
    hide bs with dissolve
    "它奔向那只蝴蝶，却又失望地远离。"
    "果然没有这么简单。"
    "第一晚就找到，是不可能的。"
    stop music fadeout 2.0
    scene bg202n with fade
    "当吊灯周围挤满七影蝶时，两人一只不得已踏上了返程的道路。"
    play music "bgm/bgm13.ogg" fadein 0.5
    "蓝" "没有找到呢。"
    "羽依里" "是啊。"
    "尽管无功而返，我却为替代苍执行她的使命感到有些小激动。"
    "抬头望去，眼前却仅有一棵迷途橘，竖立在光秃秃的平原上。"
    "她不在这里。"
    "羽依里" "苍，你看到了吗。"
    "羽依里" "我在代替执行你的使命哦。"
    "羽依里" "所以，赶快回来吧——"
    stop music fadeout 2.0
    scene bg009a with fade:
        matrixcolor SaturationMatrix(0.0)
    play music "bgm/bgm15.ogg" fadein 0.5
    "我顺着那记忆中的路线前进。"
    "那走了成百上千遍的，熟悉的路线。"
    "“熟悉”？"
    "为什么我会认为这个路线很熟悉呢？"
    "我似乎忘记了一些很重要的事情。"
    "不知不觉中，来到了那个地方。"
    scene bg201a with fade:
        matrixcolor SaturationMatrix(0.0)
    "居民区的小屋内，装着各式各样的蝴蝶标本。"
    "蝴蝶标本？"
    "有一种蝴蝶，好像没有标本。"
    "追寻记忆的旅途。"
    "记忆……？"
    stop music fadeout 0.5
    scene bg202n with fade
    show text "~ August 2nd ~" at truecenter with dissolve
    pause 2.0
    scene bg011n1 with fade
    "第七天了。"
    play music "bgm/bgm18.ogg" fadein 0.5
    "我们搜遍了整个森林，在地图上标记了所有地点。"
    "虽然七影蝶出现的地方是随机的，这种标记也只是徒劳罢了。"
    "会不会永远找不到？"
    "一闪而过的阴影。"
    "羽依里" "不会的。"
    "羽依里" "都说好了，十年我也会继续下去。"
    "万一你看不见呢？"
    "小小的声音在脑内响起。"
    "羽依里" "不不不，怎么能这么想呢。"
    "羽依里" "先别考虑这么多，先做了再说。"
    "而且还得想想办法，会不会有什么捷径。"
    "比如再抓一只稻荷。"
    "不过第二只，会不会有这种能力呢？"
    "不确定。"
    "还是先放弃思考比较好。"
    scene bg202n with fade
    stop music fadeout 0.5
    "来到了迷途橘前。"
    "把手放在树皮上，感受着老树的温度。"
    "夏日夜晚的树皮十分凉爽。"
    play music "bgm/bgm27.ogg" fadein 0.5
    "羽依里" "我们也是老朋友了啊。"
    show ai with dissolve
    "蓝" "哈啊……"
    "羽依里" "累了吗？"
    "蓝" "有点困。赶紧回去睡觉吧。"
    hide ai with dissolve
    "我把灯挂回原处，那些蝴蝶在开始绕着树盘旋。"
    "它们渐渐飞翔、升高——"
    "不断升高……"
    "蓝" "羽依里？"
    "蓝" "回去啦，快走吧。"
    "羽依里" "……"
    "蓝" "羽依里……？"
    "蓝走过来，拉住我的手。"
    "蓝" "在发什么呆呢？"
    "羽依里" "对不起，稍微开了个小差。"
    "蓝" "……"
    stop music fadeout 0.5
    scene bg011n1 with fade
    "回去的路上，我们再也没说过什么。"
    "或许是捕捉到了我内心的那一瞬动摇。"
    "而那种不安，正随着夏日的流逝而不断加剧。"
    "‘真能找到吗？’"
    play sound "effect/wood-fall-down.mp3"
    show layer master at shake 
    with Pause(0.5)
    show layer master
    "蓝" "羽依里！！！"
    "羽依里" "啊？"
    "我的手突然被另外一只手握住。"
    "羽依里" "怎么了这么突然……"
    "回头看去。"
    play music "bgm/bgm13.ogg" fadein 0.5
    "那里是悬崖，是深不可测的万丈深渊。"
    "冷汗直冒。"
    show ai with dissolve
    "蓝" "你今天怎么了，心不在焉的？"
    "羽依里" "抱歉……我没事"
    "蓝" "……"
    "她再也没多问些什么。"
    stop music fadeout 0.5
    scene bg002a with fade
    show text "~ August 3nd ~" at truecenter with dissolve
    pause 2.0
    scene bg002a with fade
    play music "bgm/bgm10.ogg" fadein 0.5
    "我们看望完苍，来到粗点心店的时候，已经是下午了。"
    "羽依里" "对了，蓝喜欢刨冰吗？"
    show ai with dissolve
    "蓝" "是啊，出院的时候都是冬天了，没机会尝。"
    "羽依里" "那我请你吃吧。要哪一个呢？虽然口味都一样就是了。"
    "蓝" "蓝色夏威夷？"
    play sound "effect/ice-cracking.mp3"
    "刨冰机器发出一阵冰块破裂的声响。"
    "蓝" "哦~！冰冰的很好吃呢。还是和小时候一样的味道呢。"
    "刨冰这种东西好像味道也不会变吧……"
    "不过她喜欢就好。"
    hide ai with dissolve
    show ru normal smile with dissolve
    "良一" "哟。"
    "羽依里" "嘿。"
    "良一递了个脸色。"
    "良一" "稍微过来一下。"
    "羽依里" "？？？"
    hide ru with dissolve
    transform zoom_right:
        linear 1.0 zoom 1.6 offset(-600,400)
    show bg002a at zoom_right
    "粗点心店旁边的阴暗角落。"
    show ru normal smile at truecenter with dissolve
    "良一" "给你看看。我的新宝贝。"
    play sound "effect/coin-get.mp3"
    show text "~获得了良一的 *** 书精选集合！~" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
    "羽依里" "这是把精彩部分全都剪贴到一本本子上了？"
    "《社恐少女与死宅少年》、《稍微有点 *** 的痴女玩伴》、《人偶少女的消失》、《邻家大姐姐的 XX 太 ** 了》"
    "《酷爱旅行的同龄少女向我告白》，《姐妹间的 *** 游戏》……"
    "XP 大集合。"
    "良一" "厉害吧，这下就不用翻来翻去了。"
    "男生的快乐就是这么简单。"
    "良一" "书就先借给你了，看完记得还回来。"
    "羽依里" "OK~！好东西怎么能一个人独享。"
    stop music fadeout 1.0
    hide ru with dissolve
    "野美希" "你们俩鬼鬼祟祟地干什么呢？"
    "羽依里/良一" "哇啊啊啊啊啊！？"
    play music "bgm/bgm35.ogg" fadein 0.5
    "书！书飞出去了！！"
    "不小心扔掉了 *** 书精选集合！"
    "野美希" "一看就不是什么好事。"
    "羽依里/良一" "没有！啊哈哈哈……"
    "良一" "……我们只是在讨论怎么收废品赚钱买冰棍而已"
    "羽依里" "啊对对对，最近刚刚给小蓝送过礼物，现在钱包空了"
    "小本子从身后的围栏飞了过去，落到别人家的院子里。"
    "野美希" "是嘛，没想到你们已经困难到这种地步了。"
    "野美希" "我这里正好"
    play sound "effect/coin-get.mp3"
    show text "~获得了 100 日元！~" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
    stop music fadeout 0.5
    "走掉了。"
    "羽依里/良一" "唔！可恶啊啊啊啊啊——"
    show ru normal smile at truecenter with dissolve
    "良一" "还好我还留了一手，羽依里，你还记得我上次给你的那叠草稿纸吗？"
    "羽依里" "草稿纸……？哦那个啊，我给镜子阿姨用了。话说什么叫留了一手"
    play music "bgm/bgm36.ogg" fadein 0.5
    "良一" "蛤？……出事了……"
    "羽依里" "什么意思？"
    "良一" "其中一张……"
    "羽依里" "其中一张？"
    "良一" "其中一张，是 *** 书集合的目录啊啊啊啊啊——！！！"
    "羽依里" "坏了"
    "羽依里" "怪不得最近镜子阿姨看我的表情怪怪的，好像几次都想说些什么都忍住了。"
    "羽依里" "没救了。"
    "良一" "没救了呢。"
    "回去好好给镜子阿姨道个歉吧。"
    stop music fadeout 0.5
    scene cg_ao09_0102 with fade
    show text "~ August 4th ~" at truecenter with dissolve
    pause 2.0
    scene bg019a1 with fade
    play music "bgm/bgm08.ogg" fadein 0.5
    "早上自然醒就是神清气爽。和被闹钟叫起来一点也不一样。"
    "话说几点了？"
    "11 点……"
    stop music
    show bg019a1:
        matrixcolor SaturationMatrix(1.0)
        linear 1.0 matrixcolor SaturationMatrix(0.0)
    "喂喂，怎么回事啊。我最近根本没碰蝴蝶啊。"
    show bg019a1:
        matrixcolor SaturationMatrix(0.0)
        linear 1.0 matrixcolor SaturationMatrix(1.0)
    "糟糕，早上 9 点约好和蓝一起去医院看望苍的。"
    "赶紧准备一下，出发前往镇上的医院。"
    play music "bgm/bgm08.ogg" fadein 0.5
    scene bg017a with fade
    show ky normal want_to_say with dissolve
    "镜子" "早上好羽依里，有个想要给你的东西。"
    menu:
        "听一下":
            jump ch2_1_c1
        "不听":
            jump ch2_1_c2
label ch2_1_c1:
    "羽依里" "是什么呢？"
    show ky normal smile
    "镜子" "啊，之前你让我再翻译一遍的书已经翻译好了。"
    "羽依里" "谢谢，我就收下了，这个肯定很有用！"
    play sound "effect/coin-get.mp3"
    show text "~获得了古书译本！~" at truecenter with dissolve
    pause 2.0
    hide text with dissolve
    "放到包里，下次有空再读一下吧。"
    show ky normal want_to_say
    "镜子" "对了，有一个新的发现……"
    show ky normal surprise
    "羽依里" "抱歉！今天有点赶时间，下次再说吧！"
    scene bg016a with fade
    "我骑上摩托车马上向医院方向跑去。"
    jump ch2_2
label ch2_1_c2:
    $ ending = 2
    jump ch2_2
label ch2_2:
    stop music fadeout 0.5
    scene cg_ao09_0201 with fade
    play music "bgm/bgm14.ogg" fadein 0.5
    "到了医院，结果蓝根本不在。"
    "护士" "蓝小姐吗？刚才好像走了，说着什么要给苍的男朋友一点教训就跑开了。"
    "羽依里" "坏了坏了。"
    "羽依里" "总之，先别管那么多了。我记得蓝说过让我来尝试一下给苍擦身体。"
    "我把病房门关好，拿出毛巾和脸盆。"
    "羽依里" "苍，要给你擦身体了哦~"
    "（咽口水）"
    scene cg_ao09_0101 with dissolve
    "慢慢掀开被子。"
    "苍" "嗯……！？"
    show layer master at shake
    with Pause(0.2)
    show layer master
    "立马缩回去了。"
    "空调太冷了吗？赶紧调高点度数。"
    "羽依里" "嘿！看我两分钟光速结束战斗！"
    "慢慢拉起苍的衣服，把毛巾贴到身上。"
    transform zoom_head:
        linear 1.0 zoom 2 offset(600,800)
    show cg_ao09_0101 at zoom_head
    "羽依里" "哇！不要乱动呀，我不是坏叔叔，不会怎么样的"
    "苍" "请温柔一点……"
    "羽依里" "怎么睡觉还在说那句？"
    show layer master at shake
    with Pause(0.4)
    show layer master
    "羽依里" "怎么回事！四肢的移动速度竟然超过了我的手速！？"
    "燃起来了！"
    "羽依里" "噢噢噢噢哦——看我的！一决胜负吧！！"
    show layer master at shake
    with Pause(1.0)
    show layer master
    "谢谢你天善。练出来的手速居然真的有用。"
    "羽依里" "好累。终于擦完了。"
    "能合法看身体真不错。"
    scene cg_ao09_0101 with dissolve
    "有点想上手摸一下。"
    "周围没有人……"
    "不行！怎么能不经过同意就这么做呢！？"
    "但是好像没人会看到欸。而且本来就是在擦身体。"
    "嗯，没事的。"
    menu:
        "偷偷摸一下":
            jump ch2_2_c1
        "放弃":
            jump ch2_2_c2
label ch2_2_c1:
    "我偷偷伸出手。"
    play music "bgm/bgm36.ogg" fadein 0.5
    "好舒服。"
    "苍" "嗯~"
    scene cg_ao09_0102 with dissolve
    "你也很舒服对吧。"
    "摸了个爽。"
    scene cg_ao09_0101 with fade
    "蓝" "喂——！为什么早上不来……啊。"
    "羽依里" "……"
    "蓝" "没事你们继续。"
    scene cg_ao09_0103 with dissolve
    "顺手把门带上了！"
    "羽依里" "等等——"
    "……"
    stop music fadeout 0.5
    scene cg_ao09_0101 with fade
    "蓝" "下次再这样我真的会报警。"
    "羽依里" "是是是，您说的都对，我知道错了。"
    jump ch2_3
label ch2_2_c2:
    "算了，放弃吧。"
    "我把手收了回来。"
    scene cg_ao09_0101 with fade
    stop music fadeout 1.0
    play music "bgm/bgm34.ogg" fadein 0.5
    "蓝" "喂——！为什么早上迟到啊。害我找了好久"
    "羽依里" "对不起……"
    "蓝" "你这家伙，连小苍都不来看，不会是心里有其他女人了吧？"
    menu:
        "没错":
            $ ending = 3
            jump be_3
        "我可是纯爱派的":
            jump ch2_2_c3
        "比起苍，我还是更喜欢你":
            jump ch2_2_c4
label be_3:
    "羽依里" "没错，找到新的女朋友了。"
    scene cg_ao09_0201 with dissolve
    "蓝" "一巴掌拍死你哦？？"
    "蓝" "我劝你坦白。"
    stop music fadeout 0.5
    "羽依里" "抱歉……"
    scene bg001a with fade:
        matrixcolor SaturationMatrix(0.0)
    play music "bgm/bgm22.ogg" fadein 0.5
    "时间，总是在不经意间溜走。"
    "在第二个夏日，我还是没能找到七影蝶。"
    "彻彻底底的失败。"
    "我放弃了。"
    "直到生命的最后，我都没有找到新的伴侣。"
    "我对不起空门家族。"
    "苍永远地沉睡着，那份夏日的恋情，从未生根发芽。"
    "或许那时苍只是为了小蓝，只是我的一厢情愿。"
    "那份夏日的邂逅锁入心房，逐渐沉默，最终消散——"
    "只留下伤心的人。"
    show text "~ BAD END 遗憾终身 ~" at truecenter with dissolve
    pause 2.0
    return
label ch2_2_c3:
    "羽依里" "我可是纯爱派的。只是不小心被床绑架了。"
    "羽依里" "不信我现在就证明给你看。"
    play music "bgm/bgm36.ogg" fadein 0.5
    show cg_ao09_0101 at zoom_head
    "我凑到苍的身上，抱在怀里亲了一口。"
    scene cg_ao09_0101 with dissolve
    "蓝" "欸！？？好了，我知道了啦。"
    "虽然本来是个妹控，但是现在经过相当长时间的适应和我的种种冲击性行为，已经成功消除了蓝的占有欲。"
    "但是少女显然对这种恩爱场景根本没有免疫力，看来直球是对的。"
    jump ch2_3
label ch2_2_c4:
    stop music fadeout 0.5
    "羽依里" "其实我忍了很久了，我还是更喜欢你啊！"
    "羽依里" "比起苍，我更喜欢蓝！"
    "蓝" "啊？"
    "彻底宕机了。"
    "蓝" "你，你再说一遍？我确认下我有没有听错。"
    menu:
        "抱歉只是开玩笑":
            jump ch2_2_c5
        "我是真心的":
            jump be_4
label ch2_2_c5:
    "羽依里" "抱歉我只是开个玩笑。"
    "蓝" "我再给你一次机会重新回答。"
    jump ch2_2_c3
label be_4:
    "羽依里" "比！起！苍！我！更喜欢！你！"
    play music "bgm/bgm18.ogg" fadein 0.5
    "蓝" "……"
    "蓝" "你可以走了。"
    "羽依里" "欸？"
    scene bg009a1 with fade
    show ai
    "蓝" "听到没有！你可以走了！不要回来了！"
    "蓝" "我再也不想见到你了！"
    hide ai with dissolve
    "蓝的脸上挂满了泪珠。"
    "蓝" "这种花心的家伙，小苍遇上了真是太倒霉了。"
    "蓝" "不过放心吧，我会永远保护小苍的。"
    "蓝" "永远……"
    show text "~ BAD END 逐出家门 ~" at truecenter with dissolve
    pause 2.0
    return
    
    return
label ch2_3:
    stop music fadeout 0.5
    scene bg009a1 with fade
    play sound "effect/rain.mp3" fadein 0.5 loop
    "好像下雨了啊。虽然只是下午，但是却根本没法看到太阳。"
    "赶紧回去吧。"
    scene bg019n1 with fade:
        matrixcolor SaturationMatrix(0.6)
    "果然，傍晚就开始下大了。"
    "镜子" "哎呀，下得还真大呢。"
    "羽依里" "是啊。今天就早点睡吧。"
    "……"
    stop sound
    pause 1.0
    play music "bgm/bgm27.ogg" fadein 0.5
    scene bg201a with fade:
        matrixcolor SaturationMatrix(0.0)
    "我顺着房门，进入了那个熟悉又陌生的房间。"
    "房间里的书架摆满了教科书，似乎是一个高中女生的房间。"
    "啊，有镜子。"
    "我究竟是个什么样的存在？"
    "我好像会飞，但似乎丢掉了一些非常重要的东西。"
    "不过，现在已经不用猜测了。"
    "映入眼帘的，是镜子中的我自己——一只发着诡异光芒的蝴蝶。"
    "蝴蝶" "我……是蝴蝶？"
    "蝴蝶" "不对，不是这样的。肯定不是。"
    "蝴蝶" "马上就要回想起来了。"
    "清晰的记忆流注入了我的脑海。"
    "那场夏日的邂逅，那些共同经历的回忆——"
    "原来是“我”啊。"
    "苍" "我怎么会忘了你呢。"
    "真不应该啊。"
    scene bg_kuro with dissolve
    "当我自责之时，时间早已夺走了我的意识。"
    "还是不行吗。"
    "抱歉……"
    "我可能要先行离开了。"
    "……"
    stop music fadeout 0.5
    scene bg202n with fade
    show text "~ Auguest 5th ~" at truecenter with dissolve
    pause 2.0
    scene bg019n3 with fade
    "？？？" "……羽依里"
    "？？？" "……醒醒……"
    "好像有人在叫我。"
    scene bg019n1 with dissolve:
        matrixcolor SaturationMatrix(0.4)
    play sound "effect/rain.mp3" fadein 0.5 loop
    "蓝" "起来了！"
    "窗外的雨声连绵不绝，是暴风雨正在经过鸟白岛吗？"
    "大颗的水珠滴落到我的脸上，面前是蓝焦急的脸色。"
    show ai with dissolve
    "蓝" "羽依里……苍她……"
    "羽依里" "苍……啊，苍怎么了！？"
    hide ai with dissolve
    "蓝" "抱歉。"
    "蓝" "可能是最后一面了。"
    "羽依里" "什么……？"
    stop sound
    play music "bgm/bgm19.ogg" fadein 0.5
    "心中的那些担忧，突然成形的那一刻——"
    show layer master:
        matrixcolor SaturationMatrix(1.0)
        linear 1.0 matrixcolor SaturationMatrix(0.0)
    "蓝" "走吧。"
    "羽依里" "……"
    "v4.0 剧情到此为止，请立即存档！"
    return




